# CwpCopyRoofInserts Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpCopyRoofInserts Property
ParameterTypeId Class See Also
---
"Copy openings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpCopyRoofInserts { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpCopyRoofInserts As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpCopyRoofInserts {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace